areiter128/DPSK3/dspic/src/init/init_pwm.c
    // PG2PER: PWM GENERATOR 1 PERIOD REGISTER        
    PG2PER      = 1000;     // 500 kHz

    // PG2TRIGA: PWM GENERATOR 1 TRIGGER A REGISTER
    PG2TRIGA    = 100;  // ToDo: Check this value on oscilloscope
    
    // PG2TRIGB: PWM GENERATOR 1 TRIGGER B REGISTER       
    PG2TRIGB    = 150;  // ToDo: Check this value on oscilloscope
    
    // PG2TRIGC: PWM GENERATOR 1 TRIGGER C REGISTER        
    PG2TRIGC    = 800;  // ToDo: Check this value on oscilloscope
    
    // PG2DTL: PWM GENERATOR 1 DEAD-TIME REGISTER LOW        
    PG2DTL      = 40;
    
    // PG2DTH: PWM GENERATOR 1 DEAD-TIME REGISTER HIGH
    PG2DTH      = 20;
            
//  PG2CAP      = 0x0000;   // Read only register
    
    return(1);
}        

volatile uint16_t launch_boost_pwm(void) {
    
    Nop();
    Nop();
    Nop();
    
    PG2CONLbits.ON = 1; // PWM Generator #2 Enable: PWM Generator is enabled
    PG2STATbits.UPDREQ = 1; // Update all PWM registers

    PG2IOCONHbits.PENH = 0; // PWMxH Output Port Enable: PWM generator controls the PWMxH output pin
    PG2IOCONHbits.PENL = 1; // PWMxL Output Port Enable: PWM generator controls the PWMxL output pin
    PG2IOCONLbits.OVRENH = 1;  // User Override Enable for PWMxH Pin: OVRDAT1 provides data for output on the PWMxH pin
    PG2IOCONLbits.OVRENL = 0;  // User Override Enable for PWMxL Pin: OVRDAT0 provides data for output on the PWMxL pin

    return(1);
}

void __attribute__((__interrupt__, no_auto_psv)) _PWM1Interrupt(void)
{
    if (++softstart_counter == SST_PERIOD) 
    {
        softstart_counter = 0;
        
        if (++SoftStartDC <= FINAL_DUTY_CYCLE) 
        {
            PG1DC++;
            PG2DC++;
            while (PG1STATbits.UPDATE | PG2STATbits.UPDATE);
            PG1STATbits.UPDREQ = 1; // Update all PWM registers
            PG2STATbits.UPDREQ = 1; // Update all PWM registers
        }
        else {
            IEC4bits.PWM1IE         = 0;    // Disabling PWM1 interrupt when PEAK_CURRENT_MAX is reached
            SoftStartFinished       = 1; 
        }
    }
    
    IFS4bits.PWM1IF     = 0;                // Clearing PWM1 interrupt flag
}